# DWFExportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFExportOptions Class
Members See Also
---
DWF Export options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DWFExportOptions : CADExportOptions
```

Visual Basic
---
```text
Public Class DWFExportOptions _
	Inherits CADExportOptions
```

Visual C++
---
```text
public ref class DWFExportOptions : public CADExportOptions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CADExportOptions Autodesk.Revit.DB..::..DWFExportOptions Autodesk.Revit.DB..::..DWFXExportOptions
# See Also
DWFExportOptions Members
Autodesk.Revit.DB Namespace